[
    "THÁNG 10\nCuộc khởi nghĩa của đồng bào Mông và binh lính ở miền núi phía bắc\nTừ tháng 7-1918, người Mông và Dao ở Tả Phình (Tủa Chùa - Lai Châu) dưới sự chỉ huy của hai thủ lĩnh Chếu và Tếnh chống lại chính sách đánh thuế nặng và cướp đất trắng trợn của thực dân Pháp làm cho bọn thống trị nhiều lần phải đưa quân đến mới dập tắt được phong trào.\nTháng 10-1918, tại vùng cao Điện Biên, dưới sự chỉ huy của Giàng Tả Chay1, người Mông cùng với người Khơ Mú, Lào đứng dậy đánh Pháp với khẩu hiệu Quét sạch tây trắng, chống thuế, giành quyền tự chủ. Phong trào nhanh chóng lan rộng và phát triển ở khắp vùng cao Lai Châu, Sơn La và lan sang cả Thượng Lào. Ở đâu nghĩa quân cũng dựa vào rừng núi chủ động chiến đấu làm cho quân Pháp điêu đứng, buộc phải thú nhận rằng, quân Pháp không chỉ đương đầu với “lũ giặc\"\" chỉ có từ 80 đến 100 tay súng mà thực ra đã phải đối phó với cả một dân tộc.\nNgoài lực lượng có ở Lai Châu, thực dân Pháp phải điều thêm quân từ Sơn La, Yên Bái đến để đàn áp và tìm cách tiến sâu vào các căn cứ Pu Nhi, Điện Biên, Long Hẹ. Nghĩa quân đã chia nhỏ lực lượng, cơ động đánh du kích khiến quân thù bị tổn thất nặng.",
    "Tiếp đó, ngày 16-11, khởi nghĩa của binh lính ở Bình Liêu - Quảng Ninh bùng nổ.\nBình Liêu có vị trí chiến lược quan trọng, án ngữ nhiều ngả đường đến các thị trấn Hoành Mô, Bắc Phong Sình và thị xã Móng Cái cũng như các đường liên lạc với Quảng Đông (Trung Quốc).\nLãnh đạo cuộc khởi nghĩa là Đàm Giám Tây (Thàm Cam Say) và Lã Thập Nhất (Lò Sáp Giáp) - vốn có nhiều mối liên hệ với các hội viên Việt Nam Quang phục Hội ở Quảng Đông và Quảng Tây. Ngoài binh lính người Việt và người Hoa, còn có sự tham gia hưởng ứng của nhân dân các dân tộc Kinh, Dao, Nùng, Hán.\nĐêm 16-11-1918 cuộc khởi nghĩa diễn ra. Nghĩa quân sau khi chiếm đồn Bình Liêu, Hoành Mô đã vượt biên giới liên lạc với Việt Nam Quang phục Hội ở hai tỉnh Quảng Đông và Quảng Tây (Trung Quốc). Ngày 19-11 họ quay lại tấn công đồn Đầm Hà, chiếm trại lính khố xanh, buộc địch phải chạy về Tiên Yên, mở rộng vùng kiểm soát ra Bình Liêu, Chúc Bài Sơn, Đầm Hà. Để đối phó lại, địch đưa nhiều đơn vị lính Pháp đến thay thế lính bản xứ ở khắp vùng Đông Bắc, tìm cách mua chuộc và chia rẽ nghĩa quân, đàn áp nhân dân, yêu cầu lực lượng biên phòng Trung Hoa giúp đỡ.\nNghĩa quân chuyển sang lối đánh du kích, đánh úp các toán tuần tiễu, mở rộng địa bàn từ Móng Cái đến Hải Phòng và một số đảo ngoài khơi vịnh Bắc Bộ, buộc Pháp phải thương thuyết. Ngày 3-6-1919, cuộc thương thảo bị vỡ, quân Pháp đẩy mạnh bao vây, triệt đường tiếp tế của nghĩa quân. Ngày 6-6, nghĩa quân rút khỏi căn cứ sang Trung Quốc, chấm dứt hoạt động vào cuối tháng 6-1919.",
    "Nguyễn Tất Thành hoạt động tại Pháp\nCuối năm 1917 đầu năm 1918, Nguyễn Tất Thành rời nước Anh đến Pari (Pháp). Lúc mới đến Pari, anh sống ẩn dật trong một căn phòng nhỏ ở đường Saron (Charonne).\nCuộc sống của Nguyễn Tất Thành hết sức khó khăn, trong những ngày đầu anh không ra ngoài đường để tránh sự kiểm soát của lính sen đầm.\nTại Pari, phải sống trong mùa đông giá lạnh, nhưng Nguyễn nhận được sự đùm bọc giúp đỡ của người bạn Tuynidi (Tunisie), tên là Moktar.\nCũng nhờ sự giúp đỡ của chí sĩ yêu nước Phan Châu Trinh và luật sư Phan Văn Trường (những năm sau đó), Nguyễn Tất Thành đã cố gắng học tiếng Pháp, đọc sách báo để hiểu thêm về nước Pháp.",
    "ĐẦU NĂM\nNguyễn Ái Quốc gia nhập Đảng Xã hội Pháp\nNgay từ khi mới đặt chân trở lại nước Pháp, Nguyễn Ái Quốc đã có mối quan hệ với các thành viên phái tả trong Đảng Xã hội Pháp và các nhà hoạt động chính trị và văn hoá nổi tiếng của Pháp như Mácxen Casanh (Marcel Cachin), Pôn Vayăng Cutuyariê (Paul Vaillant Couturier), Lêông Blum (Léon Blum), Raymông Lơphevrơ (Raymond Lefèbvre), Giăng Lôngghê (Jean Longuet), Gaxtông Môngmútxô (Gaston Monmousseau)... Người thường xuyên có mặt trong các cuộc họp của Câu lạc bộ ngoại ô Pari; gia nhập Hội Nghệ thuật và khoa học, Hội bạn của nghệ thuật, Câu lạc bộ Camelêông; đi dự và nghe các buổi diễn thuyết dành cho sinh viên thuộc địa của Hội bạn phương Đông của nước Pháp. Ngoài ra, Người đặt mua một số lượng lớn những tạp chí định kỳ (Tạp chí Tây Phi của Pháp, Nô lệ thức tỉnh, Phương Đông với người phương Đông, Tương lai xã hội, Tiếng nói An Nam).\nCuối năm 1918, Nguyễn Ái Quốc gia nhập Đoàn Thanh niên xã hội Pháp và đến đầu năm 1919, Người tham gia Đảng Xã hội Pháp, \"\"chỉ vì đây là tổ chức duy nhất ở Pháp bênh vực nước tôi, là tổ chức duy nhất theo đuổi lý tưởng cao quý của Đại cách mạng Pháp: Tự do - Bình đẳng - Bác ái\"\".",
    "NGÀY 4-3\nQuốc tế Cộng sản thành lập\nCơ quan lãnh đạo Quốc tế thứ hai, từ sau khi Ăngghen mất (năm 1895), dần dần chuyển vào tay những phần tử cơ hội, xét lại chủ nghĩa Mác, sa vào chủ nghĩa dân tộc sôvanh, đứng về phía giai cấp tư sản, phản bội lợi ích của giai cấp công nhân và nhân dân lao động.\nTrong cuộc đấu tranh chống các khuynh hướng sai lầm đó, Lênin đã vạch trần sự phản bội xấu xa của chủ nghĩa xã hội sôvanh, phát triển học thuyết cách mạng xã hội chủ nghĩa của Mác trong thời đại đế quốc chủ nghĩa.",
    "Thắng lợi của Cách mạng Tháng Mười Nga khẳng định sự đúng đắn của chủ nghĩa Lênin; thúc đẩy phong trào công nhân quốc tế phát triển mạnh mẽ và đạt tới sự chuyển biến về chất, hàng loạt đảng cộng sản thành lập và nhiều nhóm cộng sản xuất hiện ở châu Âu, châu Mỹ và châu Á.\nSự trưởng thành về lý luận cách mạng vô sản và sự phát triển tổ chức của phong trào công nhân vừa là sự chuẩn bị, vừa đặt ra những yêu cầu cấp thiết thành lập Quốc tế Cộng sản.",
    "Dưới sự chỉ đạo trực tiếp của Lênin, Hội nghị Cộng sản quốc tế khai mạc ngày 2-8-1919 tại Mátxcơva với sự tham dự của 52 đại biểu, đại diện 35 tổ chức cộng sản tại 21 nước châu Âu, châu Mỹ và châu Á. Hội nghị nghe báo cáo tình hình phát triển của phong trào cách mạng tại nhiều nước; thảo luận thông qua Cương lĩnh của Quốc tế Cộng sản. Cương lĩnh chỉ rõ nhiệm vụ của cách mạng vô sản ở các nước tư bản chủ nghĩa là thiết lập chuyên chính vô sản để tiến hành cách mạng kinh tế - xã hội, vì lợi ích của giai cấp công nhân và nhân dân lao động; khẳng định những nguyên tắc của chủ nghĩa quốc tế vô sản mà nội dung quan trọng nhất là sự phối hợp hoạt động của giai cấp vô sản trên phạm vi quốc tế, kết hợp lợi ích của giai cấp vô sản từng dân tộc với nhiệm vụ cách mạng thế giới. Quốc tế Cộng sản có trọng trách xây dựng mối quan hệ chặt chẽ giữa phong trào cách mạng của giai cấp vô sản các nước đế quốc với phong trào giải phóng dân tộc của nhân dân các nước thuộc địa, nửa thuộc địa; kiến lập liên minh giữa các nước đã tiến hành cách mạng vô sản thành công để bảo vệ thành quả cách mạng và xây dựng chủ nghĩa xã hội.",
    "Hội nghị đã nghe Lênin trình bày các luận điểm về dân chủ tư sản và chuyên chính vô sản. Người nêu bật nhiệm vụ của các đảng cộng sản là lãnh đạo cuộc đấu tranh của giai cấp vô sản lật đổ chế độ tư bản chủ nghĩa, thay thế dân chủ tư sản bằng dân chủ vô sản, xây dựng các xôviết công nông binh. Luận cương của Lênin về dân chủ tư sản và chuyên chính vô sản được Hội nghị thông qua.\nChiều ngày 4-8-1919, Hội nghị biểu quyết tán thành thành lập Quốc tế thứ ba tức Quốc tế Cộng sản. Tiếp đó, Hội nghị còn thảo luận và quyết định nhiều chủ trương quan trọng về phong trào cách mạng vô sản thế giới. Trước khi bế mạc, ngày 6-3-1919, Hội nghị thông quaTuyên ngôn của Quốc tế Cộng sản gửi những người vô sản toàn thế giới và Lời kêu gọi tất cả công nhân các nước, bao hàm nội dung chỉ đạo phong trào cộng sản và công nhân thế giới đấu tranh đập tan ách thống trị của chủ nghĩa tư bản, xây dựng nền chuyên chính vô sản.\nSự thành lập Quốc tế Cộng sản đánh dấu bước trưởng thành vượt bậc về lý luận và tổ chức của phong trào cộng sản, phong trào công nhân và phong trào giải phóng dân tộc trên thế giới. Không bao lâu sau khi ra đời, Quốc tế Cộng sản đã phát huy tác dụng trực tiếp đối với sự phát triển của cách mạng Việt Nam.",
    "NGÀY 18-4\nTôn Đức Thắng tham gia cuộc binh biến của hạm đội Pháp ở Hắc Hải và ủng hộ nước Nga Xôviết\nTôn Đức Thắng sinh ngày 20-8-1888 tại xã Mỹ Hoà Hưng, tổng Bình Thạnh, tỉnh Long Xuyên, nay là xã Mỹ Hoà Hưng, thị xã Long Xuyên, tỉnh An Giang.\nSinh ra trên một vùng đất giàu truyền thống chống ngoại xâm, tuổi trẻ của Tôn Đức Thắng được nuôi dưỡng trong tình yêu quê hương, đất nước, ý chí phản kháng chống lại mọi áp bức bóc lột của bọn thực dân cướp nước. Trong thời gian Chiến tranh thế giới thứ nhất, đồng chí làm thợ máy ở công xưởng hải quân Tulông, Pháp, sau đó bị điều xuống làm lính thợ ở chiến hạm Phơrăngxơ.\n",
    "Ngày 16-4-1919, một hạm đội Pháp gồm nhiều tàu chiến tiến sâu vào Hắc Hải, chuẩn bị nổ súng tấn công thành phố Xêvaxtôpôn của nước Nga Xôviết nhằm đè bẹp Nhà nước non trẻ này. Ngày 18-4, thuỷ thủ và binh lính trên chiến hạm Phơrăngxơ tuyên bố chống lệnh chiến đấu của chỉ huy và đưa ra khẩu hiệu: Không chiến tranh với nước Nga! Quay trở về Tulông! Tôn Đức Thắng là người thuỷ thủ Việt Nam duy nhất trong số 1.100 binh lính, thuỷ thủ trên chiến hạm đã dũng cảm tham gia phản chiến. Đến ngày 20-4, cuộc binh biến lan rộng buộc bọn chỉ huy phải điều hạm đội trở về căn cứ.\nViệc Tôn Đức Thắng tham gia cuộc binh biến Hắc Hải là một biểu hiện đẹp đẽ của tinh thần đoàn kết chiến đấu giữa cách mạng Việt Nam và cách mạng Nga.",
    "Nguyễn Ái Quốc gửi bản yêu sách của nhân dân An Nam đến Hội nghị Vécxây\nSau khi chiến tranh thế giới thứ nhất kết thúc, chính phủ các nước thắng trận tổ chức một cuộc Hội nghị ở Vécxây (ngoại vi Thủ đô nước Pháp) để phân chia thế giới. Nhân hội nghị này, bản yêu sách của nhân dân An Nam, ký tên Nguyễn Ái Quốc thay mặt nhóm những người Việt Nam yêu nước, được gửi tới đại biểu của một số nước tham dự Hội nghị. Đồng thời, bản yêu sách cũng được công bố trên các tờ báo L’Humanité (Nhân đạo) và Journal du Peuple (Nhật báo dân chúng) của Đảng Xã hội Pháp. Bản yêu sách đòi Chính phủ Pháp phải thừa nhận các quyền tự do, dân chủ và quyền bình đẳng của dân tộc Việt Nam. Nội dung gồm 8 điểm:\n- Ân xá cho tất cả chính trị phạm người bản xứ.\n- Cải cách pháp luật ở Đông Dương để người bản xứ được đảm bảo về luật pháp như người châu Âu. Bãi bỏ tất cả toà án đặc biệt.\n- Tự do báo chí và ngôn luận;\n- Tự do lập hội và hội họp;\n- Tự do cư trú ở nước ngoài và tự do xuất dương;\n- Tự do được lập trường học trong các tỉnh để dạy kỹ thuật và nghề nghiệp cần thiết cho dân bản xứ;\n- Thay thế chế độ sắc lệnh bằng các đạo luật;\n- Bầu đại diện thường trực người bản xứ làm việc bên cạnh Quốc hội Pháp để thông báo những nguyện vọng của nhân dân.\nNhận xét về văn kiện này, Bộ Nội vụ Pháp khẳng định: “Qua các cuộc điều tra về sự tuyên truyền trong các giới Việt Nam ở Pari ủng hộ bản yêu sách của nhân dân Việt Nam có thể rút ra kết luận rằng hiện nay, linh hồn của phong trào đó chính là Nguyễn Ái Quốc\"\". Sự kiện này đã gây một tiếng vang lớn, là dấu hiệu của một bước chuyển biến lịch sử của phong trào giải phóng dân tộc Việt Nam từ nay gắn liền với tên tuổi của Nguyễn Ái Quốc.",
    "THÁNG 7\nNguyễn Ái Quốc nghiên cứu Sơ thảo lần thứ nhất những Luận cương về vấn đề dân tộc và vấn đề thuộc địa của Lênin\nTừ ngày 16 và ngày 17-7-1920, liên tiếp trong hai số liền Báo Nhân đạo (L’Humanité) đăng toàn văn Sơ thảo lần thứ nhất những Luận cương về vấn đề dân tộc và vấn đề thuộc địa của Lênin dưới tiêu đề lớn là Luận cương về vấn đề dân tộc và vấn đề thuộc địa. Sau khi đọc bản Luận cương, Nguyễn Ái Quốc đã sung sướng thốt lên: \"\"Trong Luận cương ấy có những chữ chính trị khó hiểu. Nhưng cứ đọc đi đọc lại nhiều lần, cuối cùng tôi cũng hiểu được phần chính. Luận cương của Lênin làm cho tôi rất cảm động, phấn khởi, sáng tỏ, tin tưởng biết bao! Tôi vui mừng đến phát khóc lên. Ngồi một mình trong buồng mà tôi nói to lên như đang nói trước quần chúng đông đảo: “Hỡi đồng bào bị đoạ đày đau khổ! Đây là cái cần thiết cho chúng ta, đây là con đường giải phóng chúng ta!” Từ đó tôi hoàn toàn tin theo Lênin, tin theo Quốc tế thứ ba\"\".",
    "Trong Luận cương, Lênin phê phán nhiều luận điểm sai lầm của những người cầm đầu Quốc tế thứ hai về vấn đề dân tộc và vấn đề thuộc địa; lên án mạnh mẽ tư tưởng sô vanh, tư tưởng dân tộc hẹp hòi, nhấn mạnh nhiệm vụ của các Đảng Cộng sản là phải giúp đỡ thực sự phong trào cách mạng của các nước thuộc địa, phụ thuộc, nhấn mạnh sự đoàn kết giữa giai cấp vô sản các nước tư bản với quần chúng cần lao của tất cả các dân tộc để chống kẻ thù chung là đế quốc và phong kiến. Bằng cách luận giải ngắn gọn, Lênin đã làm sáng tỏ những quan điểm cơ bản của Quốc tế Cộng sản đối với phong trào giải phóng dân tộc, làm sáng rõ hướng đi và biện pháp quan trọng nhất là đưa sự nghiệp giải phóng dân tộc ở thuộc địa giành thắng lợi hoàn toàn.",
    "Chính Nguyễn Ái Quốc cũng nhận thấy bước ngoặt lớn của cuộc đời hoạt động cách mạng của mình sau 10 năm tìm tòi, thử nghiệm để nhận biết được chân lý lớn nhất của thời đại. Người nói:\n\"\"Lúc đầu, chính là chủ nghĩa yêu nước, chứ chưa phải chủ nghĩa cộng sản đã đưa tôi tin theo Lênin, tin theo Quốc tế thứ ba. Từng bước một, trong cuộc đấu tranh, vừa nghiên cứu lý luận Mác - Lênin, vừa làm công tác thực tế, dần dần tôi hiểu được rằng chỉ có chủ nghĩa xã hội, chủ nghĩa cộng sản mới giải phóng được các dân tộc bị áp bức và những người lao động trên thế giới khỏi ách nô lệ... Chủ nghĩa Lênin đối với chúng ta, những người cách mạng và nhân dân Việt Nam, không những là cái \"\"cẩm nang” thần kỳ, không những là cái kim chỉ nam mà còn là mặt trời soi sáng con đường chúng ta đi tới thắng lợi cuối cùng, đi tới chủ nghĩa xã hội và chủ nghĩa cộng sản\"\".\nBằng việc tiếp cận với Luận cương về vấn đề dân tộc và vấn đề thuộc địa của Lênin, Nguyễn Ái Quốc còn là người đầu tiên mở đường cho chủ nghĩa Mác - Lênin thâm nhập phong trào công nhân và phong trào yêu nước Việt Nam, làm cho sự nghiệp cách mạng Việt Nam gắn bó với sự nghiệp của giai cấp vô sản thế giới.",
    "NGÀY 26-12\nNguyễn Ái Quốc tham gia sáng lập Đảng Cộng sản Pháp\nĐể quyết định thái độ của những người Xã hội Pháp tham gia Quốc tế thứ ba hay ở lại Quốc tế thứ hai, Đại hội lần thứ XVIII của Đảng Xã hội Pháp họp ở Tua (Tours, Pháp) từ ngày 25 đến 30-12-1920. Với tư cách là một thành viên của Đảng Xã hội Pháp, đồng chí Nguyễn Ái Quốc tham dự Đại hội và ngồi ở phía tả của phòng họp.",
    "Tại Đại hội đồng chí Nguyễn Ái Quốc đọc tham luận tố cáo những tội ác tày trời của thực dân Pháp ở Đông Dương, kêu gọi giai cấp công nhân và những người cách mạng chân chính Pháp cần phải hoạt động một cách thiết thực để ủng hộ cuộc đấu tranh cách mạng của nhân dân Việt Nam và các thuộc địa khác. Người khẩn thiết yêu cầu: \"\"Đảng phải tuyên truyền chủ nghĩa xã hội trong tất cả các nước thuộc địa. Chúng tôi thấy rằng việc Đảng Xã hội gia nhập Quốc tế thứ ba có nghĩa là Đảng hứa một cách cụ thể rằng từ nay Đảng sẽ đánh giá đúng tầm quan trọng của vấn đề thuộc địa. Chúng tôi rất sung sướng khi nghe tin thành lập một đoàn đại biểu thường trực nghiên cứu về Bắc Phi, và mai đây, chúng tôi sẽ vui mừng nếu Đảng phái một đồng chí của Đảng để nghiên cứu tại chỗ những vấn đề ở Đông Dương và đề xuất những hoạt động cần phải tiến hành\"\"",
    "Bản tham luận của Người được Đại hội nhất trí tán thành và hoan nghênh nhiệt liệt. Cuối cùng, khi biểu quyết tán thành Quốc tế thứ ba hay ở lại Quốc tế thứ hai, cùng với những đại biểu ưu tú của giai cấp công nhân Pháp, Nguyễn Ái Quốc đã đứng hẳn về Quốc tế thứ ba, bỏ phiếu gia nhập Quốc tế Cộng sản, và Người trở thành một trong những người sáng lập Đảng Cộng sản Pháp. Người là một trong những đảng viên đầu tiên của Đảng Cộng sản Pháp, đồng thời cũng là người cộng sản Việt Nam đầu tiên.",
    "Nguyễn Ái Quốc tham gia sáng lập Đảng Cộng sản Pháp là một sự kiện chính trị vô cùng quan trọng đánh dấu một bước chuyển biến quyết định, bước nhảy vọt, thay đổi về chất trong nhận thức tư tưởng và lập trường chính trị của Người, từ một nhà yêu nước chân chính trở thành một chiến sĩ cộng sản. Đồng thời sự kiện đó cũng đánh dấu một bước ngoặt lịch sử vĩ đại của cách mạng Việt Nam, bắt đầu kết hợp đấu tranh giai cấp với đấu tranh dân tộc, độc lập dân tộc với chủ nghĩa xã hội, tinh thần yêu nước chân chính với chủ nghĩa quốc tế vô sản. Từ đây, cách mạng Việt Nam đã có lập trường vững chắc - lập trường của giai cấp vô sản."
]